## Spark SQL

In [1]:
import findspark
findspark.init()
from pyspark import SparkContext
sc = SparkContext()

In [2]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()
from pyspark.sql.types import *

## Baby Names

In [4]:
!head babynames2018_state_gender_year_fname_number.csv

AK,F,1910,Mary,14
AK,F,1910,Annie,12
AK,F,1910,Anna,10
AK,F,1910,Margaret,8
AK,F,1910,Helen,7
AK,F,1910,Elsie,6
AK,F,1910,Lucy,6
AK,F,1910,Dorothy,5
AK,F,1911,Mary,12
AK,F,1911,Margaret,7

In [5]:
schema = StructType([
    StructField('state', StringType(), False),
    StructField('gender', StringType(), False),
    StructField('year', IntegerType(), False),
    StructField('name', StringType(), False),
    StructField('number', IntegerType(), False)
])

In [6]:
baby_names = spark.read.csv('babynames2018_state_gender_year_fname_number.csv',
                   schema=schema)

In [7]:
type(baby_names)

pyspark.sql.dataframe.DataFrame

In [8]:
baby_names.createOrReplaceTempView("baby_names_v")

In [9]:
spark.sql('''
SELECT sum(number) as cnt
  FROM baby_names_v
''').show()

+---------+
|      cnt|
+---------+
|311155210|
+---------+

In [13]:
male_names = spark.sql('''
SELECT name, sum(number) as male_cnt
  FROM baby_names_v
 WHERE gender = 'M'
 GROUP BY name
''')

In [14]:
male_names.show()

+--------+--------+
|    name|male_cnt|
+--------+--------+
|   Tyler|  585054|
|  Maddox|   32360|
|  Kellen|   13281|
|Laurence|   32551|
|   Abner|    3726|
|Thurston|     588|
|  Luddie|       5|
|   Lorne|    1453|
|  Dorien|     305|
|Kamarion|    1238|
|    Utah|      38|
|  Clance|      26|
|   Aryan|    4977|
| Rosendo|    3855|
|   Tegan|     863|
| Normand|    4819|
|Francois|     281|
|  Rashan|     325|
|     Kin|       5|
|    Rony|     844|
+--------+--------+
only showing top 20 rows

In [15]:
male_names.createOrReplaceTempView("male_names_v")

In [19]:
female_names = spark.sql('''
SELECT name, sum(number) as female_cnt
  FROM baby_names_v
 WHERE gender = 'F'
 GROUP BY name
''')

In [20]:
female_names.show()

+--------+----------+
|    name|female_cnt|
+--------+----------+
| Susanna|     12065|
|   Kiana|     22450|
|   Tyler|     14381|
|  Alayna|     25847|
|Julianne|     24992|
|   Ember|      8072|
|  Azalea|      4354|
|  Heaven|     24239|
|   Leola|     20179|
|    Nell|     17482|
|  Easter|      2801|
|    Faye|     60583|
| Evelene|        31|
|    Reta|      4830|
| Merlene|       531|
|   Nyoka|       106|
|   Lesha|       137|
|   Sandi|      6812|
| Melaine|       394|
|Lashanda|      3697|
+--------+----------+
only showing top 20 rows

In [21]:
female_names.createOrReplaceTempView("female_names_v")

In [24]:
both_names = spark.sql('''
  SELECT m.name, male_cnt, female_cnt
    FROM male_names_v as m
         JOIN female_names_v as f ON m.name = f.name
''')

In [25]:
both_names.show()

+----------+--------+----------+
|      name|male_cnt|female_cnt|
+----------+--------+----------+
|     Aryan|    4977|        70|
|     Baily|      44|       224|
|    Heaven|      11|     24239|
|     Jaydn|      80|        35|
|      July|       5|        60|
|    Kellen|   13281|       105|
|     Kiana|       8|     22450|
|  Laurence|   32551|        28|
|    Luddie|       5|         5|
|    Maddox|   32360|       455|
|     Shian|       5|        41|
|     Tegan|     863|      3645|
|     Terez|      15|         5|
|     Tyler|  585054|     14381|
|    Andree|     186|       438|
|  Angelina|       5|    112552|
|    Aubrey|   24828|    109417|
|   Carolyn|     114|    549220|
|      Chad|  237667|       152|
|Charleston|     483|       432|
+----------+--------+----------+
only showing top 20 rows

In [26]:
male_names.count(), female_names.count(), both_names.count()

(13785, 20852, 3042)

In [27]:
both_names.createOrReplaceTempView("both_names_v")

In [30]:
top10 = spark.sql('''
 SELECT name, male_cnt + female_cnt as total_cnt
   FROM both_names_v
  WHERE male_cnt/female_cnt BETWEEN 0.25 AND 4
  ORDER BY total_cnt DESC
  LIMIT 10
''')

In [31]:
top10.show()

+------+---------+
|  name|total_cnt|
+------+---------+
|Willie|   533413|
|Jordan|   501077|
|Taylor|   425506|
|Leslie|   367819|
| Jamie|   348205|
| Angel|   322741|
|   Lee|   271308|
|  Dana|   237358|
|Jessie|   229814|
|Marion|   226814|
+------+---------+